--task1  (lesson7)
-- sqlite3: Перенести таблицы pc, printer, product & laptop в локальную sqlite3 (те сделать снэпшот этих таблиц из postgreSQL в sqlite3 через python).

--task2  (lesson7)
-- sqlite3: сравнить скорость обработки таблиц sqlite3 vs postgresql на примере запроса: посчитать количество всех товаров стоимостью больше 500. (через %%time перед запросом в ноутбуке)

--task3 (lesson7)
-- sqlitedict: перенести все объекты (каждый товар) из PostgreSQL в таблицу (test table). Все известные данные по объекту должны быть в паре как value в формате json

--task4 (lesson7)
-- sqlitedict: загрузите любую вашу домашнюю работу (через скрипт) в таблицу (test table). Ключ: lesson2_2, Значение: sql запрос

--task5 (lesson7)
-- sqlitedict: загрузите все домашние работы в формате json в таблицу test table.  Ключ: lesson2_2, Значение: sql запрос

--task6 (lesson7)
-- tinydb: загрузите все домашние работы в формате json в таблицу test table.  Ключ: lesson2_2, Значение: sql запрос

--task8 (lesson7)
-- neo4j: Верните всех актеров, которые играли с Томом Хэнксом и старше его.

--task9 (lesson7)
-- neo4j: Верните все фильмы с Томом Хэнксом

--task10 (lesson7)
-- neo4j: Верните все фильмы с Томом Хэнксом и с годом выпуска после 2000 года
