--схема БД: https://docs.google.com/document/d/1NVORWgdwlKepKq_b8SPRaSpraltxoMg2SIusTEN6mEQ/edit?usp=sharing
--colab/jupyter: https://colab.research.google.com/drive/1j4XdGIU__NYPVpv74vQa9HUOAkxsgUez?usp=sharing

--task1  (lesson9)
-- Компьютерная фирма: Найдите размеры жестких дисков, совпадающих у двух и более PC. Вывести: HD

--task2  (lesson9)
-- Компьютерная фирма: Найдите производителей, выпускающих по меньшей мере три различных модели ПК. Вывести: Maker, число моделей ПК.

--task3  (lesson9)
-- Корабли: Найдите классы, в которые входит только один корабль из базы данных (учесть также корабли в Outcomes).

--task4 (lesson9)
-- Компьютерная фирма: Найти производителей, которые выпускают более одной модели, при этом все выпускаемые производителем модели являются продуктами одного типа. Вывести: maker, type

--task5 (lesson9)
-- Компьютерная фирма: Найти максимальную, минимальную и среднюю цену на персональные компьютеры при условии, что средняя цена не превышает 600

--task6 (lesson9)
-- Компьютерная фирма: Получить количество ПК и среднюю цену для каждой модели, средняя цена которой менее 800

--разбор домашек
--task6 (lesson5)
-- Компьютерная фирма: Вывести все принтеры производителя = 'A' со стоимостью выше средней по принтерам производителя = 'C' и три самых дорогих (через оконные функции). Вывести model

--task12 (lesson5)
-- Компьютерная фирма: Сделать view, в которой будет постраничная разбивка всех laptop (не более двух продуктов на одной странице). Вывод: все данные из laptop, номер страницы, список всех страниц


--task1  (lesson6, дополнительно)
-- SQL: Создайте таблицу с синтетическими данными (10000 строк, 3 колонки, все типы int) и заполните ее случайными данными от 0 до 1 000 000. Проведите EXPLAIN операции и сравните базовые операции.

--task2  (lesson7)
-- oracle: https://leetcode.com/problems/duplicate-emails/

--task3  (lesson7)
-- oracle: https://leetcode.com/problems/employees-earning-more-than-their-managers/

--task10  (lesson8)
-- https://sql-academy.org/ru/trainer/tasks/44

--task11 (lesson8)
-- https://sql-academy.org/ru/trainer/tasks/20

--task12  (lesson8)
-- https://sql-academy.org/ru/trainer/tasks/55
